import React, { useRef } from "react";

import { useGetCompanyByIdQuery } from "~/redux/companies/companies-api";
import { useGetCoursesByFilterQuery } from "~/redux/courses/courses-api";
import { useGetReviewsByCompanyIdQuery } from "~/redux/reviews/reviews-companies-api";

import { About } from "./components/about/about";
import { Contacts } from "./components/contacts/contacts";
import { Courses } from "./components/courses/courses";
import { Menu } from "./components/menu/menu";
import { Reviews } from "./components/reviews/reviews";
import { TitleLogo } from "./components/title-logo/title-logo";
import styles from "./styles.module.scss";

const CompanyDetails: React.FC<{ companyId: string }> = ({ companyId }) => {
	const { data: company } = useGetCompanyByIdQuery(companyId);

	// in case you want to test with more data
	// const company = {
	// 	"address":
	// 		"вул. Михайлівська, 20, поверх 3; вул. Київська, 77;  м. Житомир, 10001",
	// 	"avg_overall_rating": 0.0,
	// 	"avg_rating": 0.0,
	// 	"categories": [
	// 		{
	// 			"id": 1,
	// 			"name": "Мовні",
	// 			"subcategories": [{ "id": 1, "name": "Англійська мова" }],
	// 		},
	// 		{
	// 			"id": 2,
	// 			"name": "Науки та підготовка до ЗНО/НМТ",
	// 			"subcategories": [
	// 				{ "id": 2, "name": "Мова" },
	// 				{ "id": 4, "name": "Англійська мова" },
	// 				{ "id": 5, "name": "Англійська мова" },
	// 			],
	// 		},
	// 		{
	// 			"id": 3,
	// 			"name": "Мовні",
	// 			"subcategories": [{ "id": 6, "name": "Англійська мова" }],
	// 		},
	// 		{
	// 			"id": 4,
	// 			"name": "Науки та підготовка до ЗНО/НМТ",
	// 			"subcategories": [
	// 				{ "id": 7, "name": "Мова" },
	// 				{ "id": 8, "name": "Мова" },
	// 				{ "id": 9, "name": "Мова" },
	// 			],
	// 		},
	// 	],
	// 	"city": "Житомир",
	// 	"contact_person": "Вета Степанівна, Оксана Петрівна",
	// 	"description":
	// 		"                                \nНавчально-консультативний Центр \n«Еліт-Голд»\n був заснований більше 8 років тому, - в 2007 році в м.Житомирі.\n\nУ 2007 р Ми були першим і єдиним навчальним центром в Житомирі, що назавжди визначило наше становище в освітній сфері в місті і області - ми завжди попереду за якістю і вибору послуг.\n\nПереваги навчання у нас:\n\n\nЗручний графік занять\n\nМісцезнаходження: студент може обрати максимально зручне місце для навчання: \n\nГоловний офіс: вул. Новий бульвар 5 (3й поверх), м. Житомир\n\nФіліал: вул. Київська 77 (ТРК Глобал), м. Житомир \n\nДоступні, помірні ціни\n\nНа всіх заняттях великий обсяг практики\n\nСерйозний і відповідальний підхід: найвищий рівень якості навчання, сервісу, організації навчального процесу.\n\nОбов'язковість - одна з головних, що відрізняють рис нашого Навчального Центру. Ми просто завжди робимо те, що обіцяємо.\n\nГідна матеріально-технічна база:\n\n\n\nбагата бібліотека, яка постійно оновлюється;\n\nаудіо- і відеотека;\n\nпрогравачі, ноутбуки, ксерокс, проектори;\n\nмаркерні і крейдяні дошки;\n\nроздаткові матеріали та наочності;\n\nповний інвентар для курсів краси.\n\n\n\nЗручна платіжна система (готівковий і безготівковий розрахунок).\n\nМи не зупиняємося на досягнутому і постійно покращувати!\n\n\nЗавдяки нашому Центру Ваші вкладення в освіту і розвиток - це безпрограшна рішення - витративши невеликий період часу на навчання, Ви все життя будете отримувати дивіденди!\n\nЕліт-Голд\n в цифрах:\n\nДата заснування - 2007 рік\n\nКолектив - 42 чол. (Адміністрація, викладацький склад, обслуговуючий персонал? Позаштатні співробітники)\n\nАудиторії - 13 (в новому навчальному році планується суттєве розширення, відкриття філії)\n\nБібліотека - 430 навчальних посібників.\n\nУчні - близько 1000 чоловік за 1 навчальний рік.\n\nhttps://www.elitegold-zt.com/\n\nМи в соцмережах: \n@elite_gold_kursy\n                            ",
	// 	"email": "elite-gold@ukr.net",
	// 	"id": 1,
	// 	"logo": "__e45c0233a58e4b94ac32cc2a8b9c3429.png",
	// 	"name": "Еліт-Голд, навчальний центр",
	// 	"phone_numbers": ["(067) 577-62-20", "(041) 241-85-09"],
	// 	"review_count": 0,
	// 	"total_reviews_count": 0,
	// 	"website": "https://www.elitegold-zt.com",
	// };

	const filters = {
		category_by_id: "",
		city: "",
		company_id: "1",
		subcategory_by_id: "",
		title: "",
	};

	const { data: courses } = useGetCoursesByFilterQuery(filters);

	// in case you want to test with more data
	// const courses = {
	// 	"count": 1,
	// 	"next": null,
	// 	"previous": null,
	// 	"results": [
	// 		{
	// 			"age":
	// 				"Дошкільники, молодша школа, середня школа, студенти, дорослі, пенсіонери",
	// 			"avg_rating": 0.0,
	// 			"categories": [
	// 				{
	// 					"id": 1,
	// 					"name": "Мовні",
	// 					"subcategories": [{ "id": 1, "name": "Англійська мова" }],
	// 				},
	// 				{
	// 					"id": 2,
	// 					"name": "Науки та підготовка до ЗНО/НМТ",
	// 					"subcategories": [{ "id": 2, "name": "Мова" }],
	// 				},
	// 			],
	// 			"company": "Еліт-Голд, навчальний центр",
	// 			"company_logo": "__e45c0233a58e4b94ac32cc2a8b9c3429.png",
	// 			"contact": "(067) 577-62-20(041) 241-85-09\nelite-gold@ukr.net",
	// 			"description":
	// 				"                                \nУ нашому навчальному центрі Ви можете вибрати будь-який зручний для Вас \nформат вивчення англійської мови:\n\n\nІндивідуальні заняття.\n\nЗаняття в парі - якщо Ви бажаєте займатися з одним / родичем удвох.\n\nЗаняття в групах.\n\nУроки по скайпу.\n\nМатеріально-технічна база.\n\n\nНа уроках використовуються:\n\n\nангломовні підручники видавництв Oxford University Press, Cambridge University Press, Pearson-Longman;\n\nавтентичні аудіо- і відеоматеріали;\n\nнаочні посібники (схеми, таблиці, карти та ін.);\n\nроздаткові матеріали;\n\nтех.оборудованіе (програвачі, комп'ютери, проектори);\n\nбілі магнітно-маркерні дошки.\n\n\nПрограма навчання.\n\nЗалежно від мети вивчення англійської мови ми пропонуємо наступні варіанти програми:\n\n\nАнглійська мова для дошкільнят / школярів:\n\n\n\nпідготовка до вивчення англійської мови в школі;\n\n«Підтягування» за шкільною програмою (всі класи);\n\nпідготовка до шкільних іспитів після 9го / 11го класу - ДПА;\n\nпідготовка до вступних іспитів - ЗНО (ЗНО);\n\n\n\nАнглійська мова для навчання / роботи закордоном, туристичних поїздок.\n\nПідготовка до міжнародних іспитів - KET, PET, FCE, CAE, TOEFL, IELTS, і ін.\n\nБізнес-курс / англійську мову для професій:\n\n\n\nIT-технології;\n\nмедицина\n\nюриспруденція,\n\nфінанси / банківська справа / бухгалтерія,\n\nсільське господарство,\n\nготельно-ресторанний, туристичний бізнес та ін .;\n\n\nМожливі також інші варіанти наповнення Вашої програми навчання - ми завжди відкриті нових пропозицій, що дозволяє нашому Навчальному Центру бути на піку актуальних тенденцій.\n\nАнглійська мова - індивідуальні заняття\n\n\nРозклад занять: будні і вихідні, ранок / день / вечір - навчаючись у нас, Ви завжди будете займатися в зручний для Вас час - графік занять складається індивідуально для кожного учня з урахуванням його побажань і можливостей щодо днів / часу уроків.\n\nКількість занять на тиждень - по замовленню учня (Ви можете вибрати будь-яке навантаження з урахуванням всіх своїх потреб і можливостей).\n\nТривалість одного заняття - 45 хв, 60 хв, 90 хв (за бажанням учня).\n\nВсі рівні від початкового до просунутого.\n\nВік: дошкільнята, школярі, дорослі. У нас немає вікових обмежень, ми віримо, що вчитися ніколи не рано і не пізно!\n\n\nАнглійська мова - групові заняття\n\nЗагальна інформація:\n\n\nзаняття 2 рази в тиждень по 1.5 години\n\nв групі (в середньому) 5 осіб\n\nбудні і вихідні, ранкові / денні / вечірні групи\n\nє діючі групи різних рівнів, плюс йде постійне формування нових груп\n\nвартість - 580 гнр / місяць\n\n\nСпрямованість курсу:\n\nГрупи для дорослих\n\nОсновна увага приділяється таким аспектам мови, як і - саме це є нашою основною метою - навчити Вас говорити на мові, що вивчається і розуміти співрозмовника. Але, безумовно, паралельно йде робота і над тими аспектами мови, які допомагають досягти основної мети - словниковим запасом, граматикою, читанням і письмом.\n\nГрупи підготовки до ЗНО (ЗНО)\n\nДаний курс є цілеспрямованою підготовкою до здачі зовнішнього незалежного тестування (ЗНО) з англійської мови. Ми враховуємо всі вимоги ЗНО, специфіку завдань, тому основний акцент спрямований на граматику, лексику (словниковий запас), розуміння текстів під час читання, письмову мову - саме ті аспекти, знання яких необхідно при здачі ВНО.Ми працюємо не тільки над англійською мовою, але і над моральною і стратегічної підготовкою до успішної здачі ЗНО. Після навчання у нас учень йде на іспит, повністю ознайомлений зі специфікою завдань і процедурою здачі ЗНО, що значно зменшує стрес на іспиті і в результаті дозволяє досягти високих балів.\n\nКваліфіковані педагоги, навчальні Вас із задоволенням і ентузіазмом.\n\nБільш детальну інформацію про наш Центр Ви можете отримати на сайті \nhttps://www.elitegold-zt.com/\n                                                                    \n                                        \nВідправити заявку\n                                    \n                                                            ",
	// 			"id": 1,
	// 			"location": "None",
	// 			"price": "195 грн за заняття",
	// 			"reviews_count": 0,
	// 			"title": "Англійська мова, індивідуально та в групах",
	// 			"website": "https://www.elitegold-zt.com",
	// 		},
	// 		{
	// 			"age":
	// 				"Дошкільники, молодша школа, середня школа, студенти, дорослі, пенсіонери",
	// 			"avg_rating": 0.0,
	// 			"categories": [
	// 				{
	// 					"id": 1,
	// 					"name": "Мовні",
	// 					"subcategories": [{ "id": 1, "name": "Англійська мова" }],
	// 				},
	// 				{
	// 					"id": 2,
	// 					"name": "Науки та підготовка до ЗНО/НМТ",
	// 					"subcategories": [{ "id": 2, "name": "Мова" }],
	// 				},
	// 			],
	// 			"company": "Еліт-Голд, навчальний центр",
	// 			"company_logo": "__e45c0233a58e4b94ac32cc2a8b9c3429.png",
	// 			"contact": "(067) 577-62-20(041) 241-85-09\nelite-gold@ukr.net",
	// 			"description":
	// 				"                                \nУ нашому навчальному центрі Ви можете вибрати будь-який зручний для Вас \nформат вивчення англійської мови:\n\n\nІндивідуальні заняття.\n\nЗаняття в парі - якщо Ви бажаєте займатися з одним / родичем удвох.\n\nЗаняття в групах.\n\nУроки по скайпу.\n\nМатеріально-технічна база.\n\n\nНа уроках використовуються:\n\n\nангломовні підручники видавництв Oxford University Press, Cambridge University Press, Pearson-Longman;\n\nавтентичні аудіо- і відеоматеріали;\n\nнаочні посібники (схеми, таблиці, карти та ін.);\n\nроздаткові матеріали;\n\nтех.оборудованіе (програвачі, комп'ютери, проектори);\n\nбілі магнітно-маркерні дошки.\n\n\nПрограма навчання.\n\nЗалежно від мети вивчення англійської мови ми пропонуємо наступні варіанти програми:\n\n\nАнглійська мова для дошкільнят / школярів:\n\n\n\nпідготовка до вивчення англійської мови в школі;\n\n«Підтягування» за шкільною програмою (всі класи);\n\nпідготовка до шкільних іспитів після 9го / 11го класу - ДПА;\n\nпідготовка до вступних іспитів - ЗНО (ЗНО);\n\n\n\nАнглійська мова для навчання / роботи закордоном, туристичних поїздок.\n\nПідготовка до міжнародних іспитів - KET, PET, FCE, CAE, TOEFL, IELTS, і ін.\n\nБізнес-курс / англійську мову для професій:\n\n\n\nIT-технології;\n\nмедицина\n\nюриспруденція,\n\nфінанси / банківська справа / бухгалтерія,\n\nсільське господарство,\n\nготельно-ресторанний, туристичний бізнес та ін .;\n\n\nМожливі також інші варіанти наповнення Вашої програми навчання - ми завжди відкриті нових пропозицій, що дозволяє нашому Навчальному Центру бути на піку актуальних тенденцій.\n\nАнглійська мова - індивідуальні заняття\n\n\nРозклад занять: будні і вихідні, ранок / день / вечір - навчаючись у нас, Ви завжди будете займатися в зручний для Вас час - графік занять складається індивідуально для кожного учня з урахуванням його побажань і можливостей щодо днів / часу уроків.\n\nКількість занять на тиждень - по замовленню учня (Ви можете вибрати будь-яке навантаження з урахуванням всіх своїх потреб і можливостей).\n\nТривалість одного заняття - 45 хв, 60 хв, 90 хв (за бажанням учня).\n\nВсі рівні від початкового до просунутого.\n\nВік: дошкільнята, школярі, дорослі. У нас немає вікових обмежень, ми віримо, що вчитися ніколи не рано і не пізно!\n\n\nАнглійська мова - групові заняття\n\nЗагальна інформація:\n\n\nзаняття 2 рази в тиждень по 1.5 години\n\nв групі (в середньому) 5 осіб\n\nбудні і вихідні, ранкові / денні / вечірні групи\n\nє діючі групи різних рівнів, плюс йде постійне формування нових груп\n\nвартість - 580 гнр / місяць\n\n\nСпрямованість курсу:\n\nГрупи для дорослих\n\nОсновна увага приділяється таким аспектам мови, як і - саме це є нашою основною метою - навчити Вас говорити на мові, що вивчається і розуміти співрозмовника. Але, безумовно, паралельно йде робота і над тими аспектами мови, які допомагають досягти основної мети - словниковим запасом, граматикою, читанням і письмом.\n\nГрупи підготовки до ЗНО (ЗНО)\n\nДаний курс є цілеспрямованою підготовкою до здачі зовнішнього незалежного тестування (ЗНО) з англійської мови. Ми враховуємо всі вимоги ЗНО, специфіку завдань, тому основний акцент спрямований на граматику, лексику (словниковий запас), розуміння текстів під час читання, письмову мову - саме ті аспекти, знання яких необхідно при здачі ВНО.Ми працюємо не тільки над англійською мовою, але і над моральною і стратегічної підготовкою до успішної здачі ЗНО. Після навчання у нас учень йде на іспит, повністю ознайомлений зі специфікою завдань і процедурою здачі ЗНО, що значно зменшує стрес на іспиті і в результаті дозволяє досягти високих балів.\n\nКваліфіковані педагоги, навчальні Вас із задоволенням і ентузіазмом.\n\nБільш детальну інформацію про наш Центр Ви можете отримати на сайті \nhttps://www.elitegold-zt.com/\n                                                                    \n                                        \nВідправити заявку\n                                    \n                                                            ",
	// 			"id": 1,
	// 			"location": "None",
	// 			"price": "195 грн за заняття",
	// 			"reviews_count": 0,
	// 			"title": "Англійська мова, індивідуально та в групах",
	// 			"website": "https://www.elitegold-zt.com",
	// 		},
	// 		{
	// 			"age":
	// 				"Дошкільники, молодша школа, середня школа, студенти, дорослі, пенсіонери",
	// 			"avg_rating": 0.0,
	// 			"categories": [
	// 				{
	// 					"id": 2,
	// 					"name": "Мовні",
	// 					"subcategories": [{ "id": 1, "name": "Англійська мова" }],
	// 				},
	// 				{
	// 					"id": 2,
	// 					"name": "Науки та підготовка до ЗНО/НМТ",
	// 					"subcategories": [{ "id": 2, "name": "Мова" }],
	// 				},
	// 			],
	// 			"company": "Еліт-Голд, навчальний центр",
	// 			"company_logo": "__e45c0233a58e4b94ac32cc2a8b9c3429.png",
	// 			"contact": "(067) 577-62-20(041) 241-85-09\nelite-gold@ukr.net",
	// 			"description":
	// 				"                                \nУ нашому навчальному центрі Ви можете вибрати будь-який зручний для Вас \nформат вивчення англійської мови:\n\n\nІндивідуальні заняття.\n\nЗаняття в парі - якщо Ви бажаєте займатися з одним / родичем удвох.\n\nЗаняття в групах.\n\nУроки по скайпу.\n\nМатеріально-технічна база.\n\n\nНа уроках використовуються:\n\n\nангломовні підручники видавництв Oxford University Press, Cambridge University Press, Pearson-Longman;\n\nавтентичні аудіо- і відеоматеріали;\n\nнаочні посібники (схеми, таблиці, карти та ін.);\n\nроздаткові матеріали;\n\nтех.оборудованіе (програвачі, комп'ютери, проектори);\n\nбілі магнітно-маркерні дошки.\n\n\nПрограма навчання.\n\nЗалежно від мети вивчення англійської мови ми пропонуємо наступні варіанти програми:\n\n\nАнглійська мова для дошкільнят / школярів:\n\n\n\nпідготовка до вивчення англійської мови в школі;\n\n«Підтягування» за шкільною програмою (всі класи);\n\nпідготовка до шкільних іспитів після 9го / 11го класу - ДПА;\n\nпідготовка до вступних іспитів - ЗНО (ЗНО);\n\n\n\nАнглійська мова для навчання / роботи закордоном, туристичних поїздок.\n\nПідготовка до міжнародних іспитів - KET, PET, FCE, CAE, TOEFL, IELTS, і ін.\n\nБізнес-курс / англійську мову для професій:\n\n\n\nIT-технології;\n\nмедицина\n\nюриспруденція,\n\nфінанси / банківська справа / бухгалтерія,\n\nсільське господарство,\n\nготельно-ресторанний, туристичний бізнес та ін .;\n\n\nМожливі також інші варіанти наповнення Вашої програми навчання - ми завжди відкриті нових пропозицій, що дозволяє нашому Навчальному Центру бути на піку актуальних тенденцій.\n\nАнглійська мова - індивідуальні заняття\n\n\nРозклад занять: будні і вихідні, ранок / день / вечір - навчаючись у нас, Ви завжди будете займатися в зручний для Вас час - графік занять складається індивідуально для кожного учня з урахуванням його побажань і можливостей щодо днів / часу уроків.\n\nКількість занять на тиждень - по замовленню учня (Ви можете вибрати будь-яке навантаження з урахуванням всіх своїх потреб і можливостей).\n\nТривалість одного заняття - 45 хв, 60 хв, 90 хв (за бажанням учня).\n\nВсі рівні від початкового до просунутого.\n\nВік: дошкільнята, школярі, дорослі. У нас немає вікових обмежень, ми віримо, що вчитися ніколи не рано і не пізно!\n\n\nАнглійська мова - групові заняття\n\nЗагальна інформація:\n\n\nзаняття 2 рази в тиждень по 1.5 години\n\nв групі (в середньому) 5 осіб\n\nбудні і вихідні, ранкові / денні / вечірні групи\n\nє діючі групи різних рівнів, плюс йде постійне формування нових груп\n\nвартість - 580 гнр / місяць\n\n\nСпрямованість курсу:\n\nГрупи для дорослих\n\nОсновна увага приділяється таким аспектам мови, як і - саме це є нашою основною метою - навчити Вас говорити на мові, що вивчається і розуміти співрозмовника. Але, безумовно, паралельно йде робота і над тими аспектами мови, які допомагають досягти основної мети - словниковим запасом, граматикою, читанням і письмом.\n\nГрупи підготовки до ЗНО (ЗНО)\n\nДаний курс є цілеспрямованою підготовкою до здачі зовнішнього незалежного тестування (ЗНО) з англійської мови. Ми враховуємо всі вимоги ЗНО, специфіку завдань, тому основний акцент спрямований на граматику, лексику (словниковий запас), розуміння текстів під час читання, письмову мову - саме ті аспекти, знання яких необхідно при здачі ВНО.Ми працюємо не тільки над англійською мовою, але і над моральною і стратегічної підготовкою до успішної здачі ЗНО. Після навчання у нас учень йде на іспит, повністю ознайомлений зі специфікою завдань і процедурою здачі ЗНО, що значно зменшує стрес на іспиті і в результаті дозволяє досягти високих балів.\n\nКваліфіковані педагоги, навчальні Вас із задоволенням і ентузіазмом.\n\nБільш детальну інформацію про наш Центр Ви можете отримати на сайті \nhttps://www.elitegold-zt.com/\n                                                                    \n                                        \nВідправити заявку\n                                    \n                                                            ",
	// 			"id": 1,
	// 			"location": "None",
	// 			"price": "195 грн за заняття",
	// 			"reviews_count": 0,
	// 			"title": "Англійська мова, індивідуально та в групах",
	// 			"website": "https://www.elitegold-zt.com",
	// 		},
	// 		{
	// 			"age":
	// 				"Дошкільники, молодша школа, середня школа, студенти, дорослі, пенсіонери",
	// 			"avg_rating": 0.0,
	// 			"categories": [
	// 				{
	// 					"id": 1,
	// 					"name": "Мовні",
	// 					"subcategories": [{ "id": 1, "name": "Англійська мова" }],
	// 				},
	// 				{
	// 					"id": 2,
	// 					"name": "Науки та підготовка до ЗНО/НМТ",
	// 					"subcategories": [{ "id": 2, "name": "Мова" }],
	// 				},
	// 			],
	// 			"company": "Еліт-Голд, навчальний центр",
	// 			"company_logo": "__e45c0233a58e4b94ac32cc2a8b9c3429.png",
	// 			"contact": "(067) 577-62-20(041) 241-85-09\nelite-gold@ukr.net",
	// 			"description":
	// 				"                                \nУ нашому навчальному центрі Ви можете вибрати будь-який зручний для Вас \nформат вивчення англійської мови:\n\n\nІндивідуальні заняття.\n\nЗаняття в парі - якщо Ви бажаєте займатися з одним / родичем удвох.\n\nЗаняття в групах.\n\nУроки по скайпу.\n\nМатеріально-технічна база.\n\n\nНа уроках використовуються:\n\n\nангломовні підручники видавництв Oxford University Press, Cambridge University Press, Pearson-Longman;\n\nавтентичні аудіо- і відеоматеріали;\n\nнаочні посібники (схеми, таблиці, карти та ін.);\n\nроздаткові матеріали;\n\nтех.оборудованіе (програвачі, комп'ютери, проектори);\n\nбілі магнітно-маркерні дошки.\n\n\nПрограма навчання.\n\nЗалежно від мети вивчення англійської мови ми пропонуємо наступні варіанти програми:\n\n\nАнглійська мова для дошкільнят / школярів:\n\n\n\nпідготовка до вивчення англійської мови в школі;\n\n«Підтягування» за шкільною програмою (всі класи);\n\nпідготовка до шкільних іспитів після 9го / 11го класу - ДПА;\n\nпідготовка до вступних іспитів - ЗНО (ЗНО);\n\n\n\nАнглійська мова для навчання / роботи закордоном, туристичних поїздок.\n\nПідготовка до міжнародних іспитів - KET, PET, FCE, CAE, TOEFL, IELTS, і ін.\n\nБізнес-курс / англійську мову для професій:\n\n\n\nIT-технології;\n\nмедицина\n\nюриспруденція,\n\nфінанси / банківська справа / бухгалтерія,\n\nсільське господарство,\n\nготельно-ресторанний, туристичний бізнес та ін .;\n\n\nМожливі також інші варіанти наповнення Вашої програми навчання - ми завжди відкриті нових пропозицій, що дозволяє нашому Навчальному Центру бути на піку актуальних тенденцій.\n\nАнглійська мова - індивідуальні заняття\n\n\nРозклад занять: будні і вихідні, ранок / день / вечір - навчаючись у нас, Ви завжди будете займатися в зручний для Вас час - графік занять складається індивідуально для кожного учня з урахуванням його побажань і можливостей щодо днів / часу уроків.\n\nКількість занять на тиждень - по замовленню учня (Ви можете вибрати будь-яке навантаження з урахуванням всіх своїх потреб і можливостей).\n\nТривалість одного заняття - 45 хв, 60 хв, 90 хв (за бажанням учня).\n\nВсі рівні від початкового до просунутого.\n\nВік: дошкільнята, школярі, дорослі. У нас немає вікових обмежень, ми віримо, що вчитися ніколи не рано і не пізно!\n\n\nАнглійська мова - групові заняття\n\nЗагальна інформація:\n\n\nзаняття 2 рази в тиждень по 1.5 години\n\nв групі (в середньому) 5 осіб\n\nбудні і вихідні, ранкові / денні / вечірні групи\n\nє діючі групи різних рівнів, плюс йде постійне формування нових груп\n\nвартість - 580 гнр / місяць\n\n\nСпрямованість курсу:\n\nГрупи для дорослих\n\nОсновна увага приділяється таким аспектам мови, як і - саме це є нашою основною метою - навчити Вас говорити на мові, що вивчається і розуміти співрозмовника. Але, безумовно, паралельно йде робота і над тими аспектами мови, які допомагають досягти основної мети - словниковим запасом, граматикою, читанням і письмом.\n\nГрупи підготовки до ЗНО (ЗНО)\n\nДаний курс є цілеспрямованою підготовкою до здачі зовнішнього незалежного тестування (ЗНО) з англійської мови. Ми враховуємо всі вимоги ЗНО, специфіку завдань, тому основний акцент спрямований на граматику, лексику (словниковий запас), розуміння текстів під час читання, письмову мову - саме ті аспекти, знання яких необхідно при здачі ВНО.Ми працюємо не тільки над англійською мовою, але і над моральною і стратегічної підготовкою до успішної здачі ЗНО. Після навчання у нас учень йде на іспит, повністю ознайомлений зі специфікою завдань і процедурою здачі ЗНО, що значно зменшує стрес на іспиті і в результаті дозволяє досягти високих балів.\n\nКваліфіковані педагоги, навчальні Вас із задоволенням і ентузіазмом.\n\nБільш детальну інформацію про наш Центр Ви можете отримати на сайті \nhttps://www.elitegold-zt.com/\n                                                                    \n                                        \nВідправити заявку\n                                    \n                                                            ",
	// 			"id": 1,
	// 			"location": "None",
	// 			"price": "195 грн за заняття",
	// 			"reviews_count": 0,
	// 			"title": "Англійська мова, індивідуально та в групах",
	// 			"website": "https://www.elitegold-zt.com",
	// 		},
	// 	],
	// };

	const contactsRef = useRef(null);
	const aboutRef = useRef(null);
	const coursesRef = useRef(null);

	const { data: reviews } = useGetReviewsByCompanyIdQuery(companyId);

	if (company && courses) {
		return (
			<div className={styles["company-details_container"]}>
				<TitleLogo company={company} />
				<Menu
					aboutRef={aboutRef}
					contactsRef={contactsRef}
					coursesRef={coursesRef}
				/>
				<Contacts company={company} ref={contactsRef} />
				<About company={company} ref={aboutRef} />
				<Courses company={company} courses={courses} ref={coursesRef} />
				<Reviews reviews={reviews} />
			</div>
		);
	}
};

export { CompanyDetails };
